package jieyi.accservice.bizform;

/**
 * 外部接口常量，如交易代码，错误代码等
 * 
 * @author pxm
 */
public enum Constant {


    //交易代码如下

	/**
	 * 客管返回成功
	 */
	 RSP_CODE_00000("00000", "客管返回成功"),

    //错误代码如下
    /**
     * 00-成功
     */
    RSP_CODE_00("00", "成功"),


    /**
     * 01-失败
     */
    RSP_CODE_01("01", "失败"),
    /**
     * 02-验签失败
     */
    RSP_CODE_02("02", "验签失败"),
    /**
     * 03-签到PINKEY校验失败
     */
    RSP_CODE_03("02", "签到PINKEY校验失败"),
    /**
     * 04-签到失败
     */
    RSP_CODE_04("04", "签到失败"),
    /**
     * 05-TMK下载失败
     */
    RSP_CODE_05("05", "TMK下载失败"),
    /**
     * 06-卡号不存在
     */
    RSP_CODE_06("06", "卡号不存在"),
    /**
     * 08-CVV2码错误
     */
    RSP_CODE_08("08", "CVV2码错误"),
    /**
     * 10-持卡人身份信息有误
     */
    RSP_CODE_10("10", "持卡人身份信息有误"),
    /**
     * 12-该卡已升级为主卡，不能作为附卡绑定
     */
    RSP_CODE_12("12", "该卡已升级为主卡，不能作为附卡绑定"),
    /**
     * 16-非记名卡不能预挂失
     */
    RSP_CODE_16("16", "非记名卡不能预挂失"),
    /**
     * 18-预挂失次数超限
     */
    RSP_CODE_18("18", "预挂失次数超限"),
    /**
     * 20-转入卡为非记名卡，不允许转账
     */
    RSP_CODE_20("20", "转入卡为非记名卡，不允许转账"),
    /**
     * 21-卡片没有相关商户
     */
    RSP_CODE_21("21", "卡片没有相关商户"),
    /**
     * 23-转出卡密码错误
     */
    RSP_CODE_23("23", "转出卡密码错误"),
    /**
     * 25-转出卡余额不足
     */
    RSP_CODE_25("25", "转出卡余额不足"),
    /**
     * 42-卡片无此账号
     */
    RSP_CODE_42("42", "卡片无此账号"),
    /**
     * 55-卡片密码错误
     */
    RSP_CODE_55("55", "卡片密码错误"),
    /**
     * 83-卡片密码错误
     */
    RSP_CODE_83("83", "卡片密码错误次数超限"),
    /**
     * 36-卡已锁定
     */
    RSP_CODE_36("36", "卡已锁定"),
    /**
     * 54-卡已过有效期
     */
    RSP_CODE_54("54", "卡已过有效期"),
    /**
     * 96-后台系统错误
     */
    RSP_CODE_96("000096", "后台系统错误"),
    RSP_CODE_97("000097", "签名错误"),

    /**
     * 62-该卡已记名
     */
    RSP_CODE_62("62", "该卡已记名"),
    /**
     * 63-该卡已升级为主卡，无需重复升级
     */
    RSP_CODE_63("63", "该卡已升级为主卡，无需重复升级"),
    /**
     * 64-该卡已被其他主卡绑定，无法升级为主卡
     */
    RSP_CODE_64("64", "该卡已被其他主卡绑定，无法升级为主卡"),
    /**
     * 65-附卡未注册，请输入附卡卡密和CVV2
     */
    RSP_CODE_65("65", "附卡未注册，请输入附卡卡密和CVV2"),
    /**
     * 66-上送的主卡卡号经校验并未升级为主卡，请升级为主卡后进行绑定操作
     */
    RSP_CODE_66("66", "上送的主卡卡号经校验并未升级为主卡，请升级为主卡后进行绑定操作"),
    /**
     * 67-上送的附卡卡号经校验已被其他主卡所绑定，请解除绑定后再进行操作
     */
    RSP_CODE_67("67", "上送的附卡卡号经校验已被其他主卡所绑定，请解除绑定后再进行操作"),
    /**
     * 69-主卡与附卡之间具有不同的产品，不能绑定
     */
    RSP_CODE_69("69", "主卡与附卡之间具有不同的产品，不能绑定"),
    /**
     * 70-附卡未绑定，无法进行解绑操作
     */
    RSP_CODE_70("70", "附卡未绑定，无法进行解绑操作"),
    /**
     * 71-卡未被锁定，无需解锁
     */
    RSP_CODE_71("71", "卡未被锁定，无需解锁"),
    /**
     * 72-解锁次数已用完
     */
    RSP_CODE_72("72", "解锁次数已用完"),
    /**
     * 73-卡未记名，无法进行预挂失操作
     */
    RSP_CODE_73("73", "卡未记名，无法进行预挂失操作"),
    /**
     * 74-卡已进行预挂失，无法进行预挂失操作
     */
    RSP_CODE_74("74", "卡已进行预挂失，无法进行预挂失操作"),
    /**
     * 75-卡已挂失，无法进行预挂失操作
     */
    RSP_CODE_75("75", "卡已挂失，无法进行预挂失操作"),
    /**
     * 76-证件号不匹配，无法进行预挂失操作
     */
    RSP_CODE_76("76", "证件号不匹配，无法进行预挂失操作"),
    /**
     * 77-卡未记名，无法进行解挂操作
     */
    RSP_CODE_77("77", "卡未记名，无法进行解挂操作"),
    /**
     * 78-卡未挂失，无法进行解挂操作
     */
    RSP_CODE_78("78", "卡未挂失，无法进行解挂操作"),
    /**
     * 79-证件号不匹配，无法进行解挂操作
     */
    RSP_CODE_79("79", "证件号不匹配，无法进行解挂操作"),
    /**
     * 80-卡已注册，请勿重新注册
     */
    RSP_CODE_80("80", "卡已注册，请勿重新注册"),
    /**
     * 81-卡有效性校验失败
     */
    RSP_CODE_81("81", "卡有效性校验失败"),
    /**
     * 98-该卡在订单中不存在
     */
    RSP_CODE_98("98", "该卡在订单中不存在"),
    /**
     * 95-账户有问题
     */
    RSP_CODE_95("95", "账户有问题"),
    /**
     * 99-该订单已经申请激活
     */
    RSP_CODE_99("99", "该订单已经申请激活"),
    /**
     * 100-订单激活申请验证码错误
     */
    RSP_CODE_100("100", "订单激活申请验证码错误"),
    /**
     * 查询客户信息出错
     */
    RSP_CODE_101("101", "查询客户信息出错"),
    /**
     * 102-电话不匹配
     */
    RSP_CODE_102("102", "电话不匹配"),
    /**
     * 103-转出卡金额为空
     */
    RSP_CODE_103("103", "转出卡金额为空"),
    /**
     * 104-转出卡金额长度不正确
     */
    RSP_CODE_104("104", "转出卡金额长度不正确"),
    /**
     * 105-转入卡号为空
     */
    RSP_CODE_105("105", "转入卡号为空"),
    /**
     * 106-转入卡号长度不正确
     */
    RSP_CODE_106("106", "转入卡号长度不正确"),
    /**
     * 107-转出卡号为空
     */
    RSP_CODE_107("107", "转出卡号为空"),
    /**
     * 108-转出卡号长度不正确
     */
    RSP_CODE_108("108", "转出卡号长度不正确"),
    
    /**
     * 147-转入卡卡号不是数字
     */
    RSP_CODE_147("147", "转入卡卡号不是数字"),
    /**
     * 148-转出卡卡号不是数字
     */
    RSP_CODE_148("148", "转出卡卡号不是数字"),
    /**
     * 151-转出账户余额不足
     */
    RSP_CODE_151("151", "转出账户余额不足"),
    /**
     * 152-转入卡充值金额超限
     */
    RSP_CODE_152("152", "转入卡充值金额超限"),
    /**
     * 157-无效金额
     */
    RSP_CODE_157("157", "无效金额"),
    /**
     * 163-转出卡卡产品未设置转账规则
     */
    RSP_CODE_163("163", "转出卡卡产品未设置转账规则"),
    /**
     * 164-转出金额小于转账规则设置的最小转账金额
     */
    RSP_CODE_164("164", "转出金额小于转账规则设置的最小转账金额"),
    /**
     * 109-电话为空
     */
    RSP_CODE_109("109", "电话为空"),
    /**
     * 110-电话长度不正确
     */
    RSP_CODE_110("110", "电话长度不正确"),
    /**
     * 111-激活申请码为空
     */
    RSP_CODE_111("111", "激活申请码为空"),
    /**
     * 112-激活申请码长度不正确
     */
    RSP_CODE_112("112", "激活申请码长度不正确"),
    /**
     * 128-手机号码为空
     */
    RSP_CDOE_128("128", "手机号码为空"),
    /**
     * 113-商户号为空
     */
    RSP_CODE_113("113", "商户号为空"),
    /**
     * 114-商户号长度不正确
     */
    RSP_CODE_114("114", "商户号长度不正确"),
    /**
     * 115-卡金额为空
     */
    RSP_CODE_115("115", "卡金额为空"),
    /**
     * 116-卡金额长度不正确
     */
    RSP_CODE_116("116", "卡金额长度不正确"),
    /**
     * 117-附卡卡号为空
     */
    RSP_CODE_117("117", "附卡卡号为空"),
    /**
     * 118-附卡卡号长度不正确
     */
    RSP_CODE_118("118", "附卡卡号长度不正确"),
    /**
     * 122-证件类型为空
     */
    RSP_CODE_122("122", "证件类型为空"),
    /**
     * 123-证件类型长度不正确
     */
    RSP_CODE_123("123", "证件类型长度不正确"),
    /**
     * 124-证件图片为空
     */
    RSP_CODE_124("124", "证件图片为空"),
    /**
     * 125-卡密码为空
     */
    RSP_CODE_125("125", "卡密码为空"),
    /**
     * 126-卡密码长度不正确
     */
    RSP_CODE_126("126", "卡密码长度不正确"),
    /**
     * 127-持卡姓名长度不正确
     */
    RSP_CODE_127("127", "持卡姓名长度不正确"),
    /**
     * 128-手机号码为空
     */
    RSP_CODE_128("128", "手机号码为空"),
    /**
     * 130-证件号码为空
     */
    RSP_CODE_130("130", "证件号码为空"),
    /**
     * 131-证件号码长度不正确
     */
    RSP_CODE_131("131", "证件号码长度不正确"),
    /**
     * 132-交易流水号为空
     */
    RSP_CODE_132("132", "交易流水号为空"),
    /**
     * 133-交易流水号长度不正确
     */
    RSP_CODE_133("133", "交易流水号长度不正确"),
    /**
     * 134-卡号为空
     */
    RSP_CODE_134("134", "卡号为空"),
    /**
     * 135-卡号不是数字
     */
    RSP_CODE_135("135", "卡号不是数字"),
    /**
     * 136-卡号长度不正确
     */
    RSP_CODE_136("136", "卡号长度不正确"),
    /**
     * 137-渠道号为空
     */
    RSP_CODE_137("137", "渠道号为空"),
    /**
     * 138-渠道号长度不正确
     */
    RSP_CODE_138("138", "渠道号长度不正确"),
    /**
     * 139-卡新密码为空
     */
    RSP_CODE_139("139", "卡新密码为空"),
    /**
     * 140-卡新密码长度不正确
     */
    RSP_CODE_140("140", "卡新密码长度不正确"),
    /**
     * 141-卡原密码为空
     */
    RSP_CODE_141("141", "卡原密码为空"),
    /**
     * 142-卡原密码长度不正确
     */
    RSP_CODE_142("142", "卡原密码长度不正确"),
    /**
     * 153-获取账户号失败
     */
    RSP_CODE_153("153", "获取账户号失败"),
    /**
     * 154-原交易流水号长度不正确
     */
    RSP_CODE_154("154", "原交易流水号长度不正确"),
    /**
     * 155-原交易流水号为空
     */
    RSP_CODE_155("155", "原交易流水号为空"),
    /**
     * 155-原交易流水号为空
     */
    RSP_CODE_156("156", "卡库存不够"),
    /**
     * 161-无此账户
     */
    RSP_CODE_161("161", "无此账户"),
    /**
     * 162-该消费交易未找到
     */
    RSP_CODE_162("162", "该消费交易未找到"),
    /**
     * 170-卡未记名
     */
    RSP_CODE_170("170", "卡未记名"),

    /**
     * 200-无效商户号
     */
    RSP_CODE_200("200", "无效商户号"),
    /**
     * 201-机构号为空
     */
    RSP_CODE_201("201", "机构号为空"),
    /**
     * 202-无效机构号
     */
    RSP_CODE_202("202", "无效机构号"),
    /**
     * 203-终端号为空
     */
    RSP_CODE_203("203", "终端号为空"),
    /**
     * 204-无效终端号
     */
    RSP_CODE_204("204", "无效终端号"),
    /**
     * 205-姓名
     */
    RSP_CODE_205("205", "姓名为空"),
    /**
     * 206-卡片状态不正确
     */
    RSP_CODE_206("206", "卡片状态不正确"),
    /**
     * 207-客户姓名不匹配
     */
    RSP_CODE_207("207", "客户姓名不匹配"),
    /**
     * 208-客户手机号不匹配
     */
    RSP_CODE_208("208", "客户手机号不匹配"),
    /**
     * 209-客户证件号不匹配
     */
    RSP_CODE_209("209", "客户证件号不匹配"),
    /**
     * 210-密码验证失败
     */
    RSP_CODE_210("210", "密码验证失败"),
    /**
     * 211-该账户存在非线上充值交易
     */
    RSP_CODE_211("211", "该账户存在非线上充值交易"),
    /**
     * 212-该卡号不存在账户卡绑定关系，无法圈存
     */
    RSP_CODE_212("212", "该卡号不存在账户卡绑定关系，无法圈存"),
    /**
     * 213-该卡不允许圈存
     */
    RSP_CODE_213("213", "该卡不允许圈存"),
    /**
     * 214-账户实名信息错误
     */
    RSP_CODE_214("214", "账户实名信息错误"),
    /**
     * 215-密码错误
     */
    RSP_CODE_215("215", "密码错误"),
    /**
     * 216-开户失败
     */
    RSP_CODE_216("216", "开户失败"),
    /**
     * 217-绑卡失败
     */
    RSP_CODE_217("217", "绑卡失败"),
    /**
     * 218-卡片解绑失败
     */
    RSP_CODE_218("218", "卡片解绑失败"),
    /**
     * 219-账户冻结失败
     */
    RSP_CODE_219("219", "账户冻结失败"),
    /**
     * 220-账户解冻失败
     */
    RSP_CODE_220("220", "账户解冻失败"),
    /**
     * 221-密码修改失败
     */
    RSP_CODE_221("221", "密码修改失败"),
    /**
     * 222-密码重置失败
     */
    RSP_CODE_222("222", "密码重置失败"),
    /**
     * 223-密码验证失败
     */
    RSP_CODE_223("223", "密码验证失败"),
    /**
     * 224-充值验证失败
     */
    RSP_CODE_224("224", "充值验证失败"),
    /**
     * 225-充值撤销失败
     */
    RSP_CODE_225("225", "充值撤销失败"),
    /**
     * 226-消费失败
     */
    RSP_CODE_226("226", "账户消费失败"),
    /**
     * 227-消费撤销失败
     */
    RSP_CODE_227("227", "消费撤销失败"),
    /**
     * 228-账户退货失败
     */
    RSP_CODE_228("228", "账户退货失败"),
    
    /**
     * 账户余额小于最低消费金额，不能生成二维码
     */
    RSP_CODE_229("229", "账户余额小于最低消费金额，不能生成二维码"),
    
    /**
     * 二维码已过期，请重新生成
     */
    RSP_CODE_230("230", "二维码已过期，请重新生成"),
    
    /**
     * 不存在账户信息，请重新开户
     */
    RSP_CODE_231("231", "不存在账户信息，请重新开户"),
    
    /**
     * 没有查到该账户信息，请重新开户
     */
    RSP_CODE_232("232", "没有查到该账户信息，请重新开户"),
    
    /**
     * 实名注册并认证失败，开户失败
     */
    RSP_CODE_233("233", "实名注册并认证失败，开户失败"),
    
    /**
     * 非实名注册失败，开户失败
     */
    RSP_CODE_235("235", "非实名注册失败，开户失败"),
    /**
     * 234-密码错
     */
    RSP_CODE_234("234", "密码错"),
    /**
     * 236-该卡号不存在账户卡绑定关系
     */
    RSP_CODE_236("236", "该卡号不存在账户卡绑定关系"),
    /**
     * 237-客户信息与实名认证不一致
     */
    RSP_CODE_237("237", "客户信息与实名认证不一致"),
    /**
     * 238-销户中，请联系客服处理
     */
    RSP_CODE_238("238", "销户中，请联系客服处理"),
    
    
    
    RSP_CODE_0026("0026", "APDU结果数量不正确"),
    RSP_CODE_0039("0039", "TblBseOrder订单不存在"),
    RSP_CODE_0040("0040", "TblBseOrder订单状态非法"),
    RSP_CODE_0042("0042", "tblBseOrder查询订单表资源忙"),

    RSP_CODE_0152("0152", "充值失败，请退款或则重新发起充值"),
    RSP_CODE_0153("0153", "卡管理包号不正确"),
    RSP_CODE_0154("0154", "充值成功，不需要进行卡管理"),
    RSP_CODE_0155("0155", "转人工处理，不需要进行卡管理"),
    /**
     * 对账日期为空
     */
    RSP_CODE_999996("999996", "对账日期为空"),
    /**
     * 文件类型为空
     */
    RSP_CODE_999995("999995", "对账文件为空"),
    /**
     * 文件类型为空
     */
    RSP_CODE_999997("999997", "文件类型为空"),
    /**
     * 999998-交易类型为空
     */
    RSP_CODE_999998("999998", "交易类型为空"),
    /**
     * 999999-非法的交易类型
     */
    RSP_CODE_999999("999999", "非法的交易类型"),

    //交易类型说明
    /**
     * 3001-余额查询
     */
    TXN_TYPE_3001("3001", "余额查询"),
    /**
     * 3002-密码修改
     */
    TXN_TYPE_3002("3002", "密码修改"),
    /**
     * 3003-消费
     */
    TXN_TYPE_3003("3003", "消费"),
    /**
     * 3004-消费冲正
     */
    TXN_TYPE_3004("3004", "消费冲正"),
    /**
     * 3005-消费撤消
     */
    TXN_TYPE_3005("3005", "消费撤消"),
    /**
     * 3006-消费撤消冲正
     */
    TXN_TYPE_3006("3006", "消费撤消冲正"),
    /**
     * 3007-退货
     */
    TXN_TYPE_3007("3007", "退货"),
    /**
     * 3008-圈存请求
     */
    TXN_TYPE_3008("3008", "圈存请求"),
    /**
     * 3009-圈存请求
     */
    TXN_TYPE_3009("3009", "圈存请求"),
    /**
     * 3010-账户开户
     */
    TXN_TYPE_3010("3010", "账户开户"),
    /**
     * 3011-账户退资
     */
    TXN_TYPE_3011("3011", "账户退资"),
    /**
     * 3012-账户注销
     */
    TXN_TYPE_3012("3012", "账户注销"),
    /**
     * 4001-订单发起
     */
    TXN_TYPE_4001("4001", "订单发起"),
    /**
     * 4002-订单查询
     */
    TXN_TYPE_4002("4002", "订单查询"),
    /**
     * 4003-订单支付通知
     */
    TXN_TYPE_4003("4003", "订单支付通知"),
    /**
     * 4004-卡片发卡
     */
    TXN_TYPE_4004("4004", "空中发卡"),
    /**
     * 4005-卡片开卡
     */
    TXN_TYPE_4005("4005", "卡片开卡"),
    /**
     * 4006-卡片充值
     */
    TXN_TYPE_4006("4006", "卡片充值"),

    /**
     * 5001-卡片密钥置换
     */
    TXN_TYPE_5001("5001", "卡片密钥置换"),
    /**
     * 5002-卡片发卡
     */
    TXN_TYPE_5002("5002", "卡片发卡"),
    /**
     * 5003-门锁延期
     */
    TXN_TYPE_5003("5003", "门锁延期"),
    /**
     * 5004-卡验证
     */
    TXN_TYPE_5004("5004", "卡验证"),
    /**
     * 6001-消费(接入)
     */
    TXN_TYPE_6001("6001", "消费(接入)"),
    /**
     * 6002-终端心跳上传
     */
    TXN_TYPE_6002("6002", "终端心跳上传"),
    /**
     * 6101-消费(转出)
     */
    TXN_TYPE_6101("6101", "消费(转成)"),
    /**
     * 6102-交易查询
     */
    TXN_TYPE_6102("6102", "交易查询"),

    //异常抛出
    /**
     * 10001-未找到请求包号
     */
    TRAN_CODE_10001("10001", "未找到请求包号"),

    /**
     * 10002-数据库异常
     */
    TRAN_CODE_10002("10002", "数据库异常"),

    /**
     * 10003-订单不存在
     */
    TRAN_CODE_10003("10003", "订单不存在"),

    /**
     * 10004-订单状态非法
     */
    TRAN_CODE_10004("10004", "订单状态非法"),

    /**
     * 10005-订单类型不正确
     */
    TRAN_CODE_10005("10005", "订单类型不正确"),

    /**
     * 10006-充值金额不等于订单金额
     */
    TRAN_CODE_10006("10006", "充值金额不等于订单金额"),

    /**
     * 10007-超过卡片充值上限
     */
    TRAN_CODE_10007("10007", "超过卡片充值上限"),

    /**
     * 10008-拼装方法不存在
     */
    TRAN_CODE_10008("10008", "拼装方法不存在"),

    /**
     * 10009-APDU返回错误
     */
    TRAN_CODE_10009("10009", "APDU返回错误"),

    /**
     * 10010-卡号不一样
     */
    TRAN_CODE_10010("10010", "卡号不一样"),

    /**
     * 10011-未找到准备数据记录
     */
    TRAN_CODE_10011("10010", "未找到准备数据记录"),

    /**
     * 10012-无可用卡
     */
    TRAN_CODE_10012("10012", "无可用卡"),

    TRAN_CODE_10013("10013", "门锁企业不存在"),
    TRAN_CODE_10014("10014", "数据转换失败"),
    TRAN_CODE_10015("10015", "重置金额大于发卡商充值额度"),
    TRAN_CODE_10016("10016", "TSM发卡商订单卡号不对应"),
    

    CARD_OPR_TYPE_80("80", "CPU售卡"),
    CARD_OPR_TYPE_02("02", "CPU充值"),

    /**
     * 订单状态
     */
    TBL_BSE_ORDER_STATE_0("0", "初始状态"),
    TBL_BSE_ORDER_STATE_1("1", "已支付"),
    TBL_BSE_ORDER_STATE_2("2", "已经密钥授权"),
    TBL_BSE_ORDER_STATE_3("3", "卡操作失败"),
    TBL_BSE_ORDER_STATE_4("4", "卡操作结果未知"),
    TBL_BSE_ORDER_STATE_5("5", "交易已确认"),
    TBL_BSE_ORDER_STATE_6("6", "密钥授权中"),
    TBL_BSE_ORDER_STATE_7("7", "交易确认中"),
    TBL_BSE_ORDER_STATE_8("8", "退款申请"),
    TBL_BSE_ORDER_STATE_9("9", "退款成功"),
    TBL_BSE_ORDER_STATE_A("A", "退款失败"),
    TBL_BSE_ORDER_STATE_B("B", "充值中"),
    TBL_BSE_ORDER_STATE_C("C", "充值完成"),
    TBL_BSE_ORDER_STATE_D("D", "充值失败"),
    TBL_BSE_ORDER_STATE_E("E", "充值撤销"),

    /**
     * 订单状态
     */
    TBL_BSE_PAY_STATUS_1("1", "支付成功"),
    TBL_BSE_PAY_STATUS_2("2", "退款成功"),
    TBL_BSE_PAY_STATUS_3("3", "退款失败"),

    /**
     * 文件生成状态
     */
    TBL_FILE_STATUS_0("0", "初始化"),
    TBL_FILE_STATUS_1("1", "成功"),
    TBL_FILE_STATUS_2("2", "失败"),

    /**
     * 准备数据状态
     */
    T_TPDATA_STATE0("0", "初始状态"),
    T_TPDATA_STATE1("1", "订单锁定"),
    T_TPDATA_STATE2("2", "写卡中"),
    T_TPDATA_STATE3("3", "写卡完成"),

    /**
     * 认证码数据状态
     */
    T_DTL_STATE0("0", "初始状态"),
    T_DTL_STATE1("1", "绑定中"),
    T_DTL_STATE2("2", "空发成功"),
    T_DTL_STATE3("3", "已下发"),

    TRANS_TYPE_00("00", "卡片充值"),
    TRANS_TYPE_11("11", "账户充值"),

    FIELD_ELEMENT_Y("Y", "Y"),

    CARD_OPRRLT_RESULT_0("0", "成功"),
    CARD_OPRRLT_RESULT_1("1", "失败"),
    CARD_OPRRLT_RESULT_2("2", "未确认（需要人工审核）"),
    
    /**
     * 62卡状态
     */
    T_62card_STATE_E("E", "成品卡"),
    T_62card_STATE_A("A", "已销售已激活"),
    T_62card_STATE_N("N", "已销售未激活"),
    T_62card_STATE_T("T", "已换卡"),
    T_62card_STATE_G("G", "作废卡"),
    T_62card_STATE_K("K", "口头（临时）挂失"),
    T_62card_STATE_L("L", "正式挂失"),
    T_62card_STATE_X("X", "过期卡"),
    
    /**
     * 主账户状态
     */
    T_Account_STATUS_1("1","正常"),
    T_Account_STATUS_3("3","冻结"),
    T_Account_STATUS_6("6","销户申请"),
    T_Account_STATUS_9("9","已销户"),
    /**
     * 住建部卡状态
     */
    T_zjbcard_STATE_0("0","正常"),
    /**
     * 交通部卡状态
     */
    T_jtbcard_STATE_3("3","正常"),
    /**
     * pboc卡状态
     */
    T_pboccard_STATE_0("0","正常"),
    /**
     * 日志常量说明
     */
    LOG_TXNCODE_1001("1001", "余额查询"),
    LOG_TXNCODE_1002("1002", "密码修改"),
    LOG_TXNCODE_1003("1003", "消费"),
    LOG_TXNCODE_1004("1004", "消费撤销"),
    LOG_TXNCODE_1005("1005", "退货"),
    LOG_TXNCODE_1006("1006", "账户圈存请求"),
    LOG_TXNCODE_1007("1007", "账户圈存确认"),
    LOG_TXNCODE_1008("1008", "账户开户"),
    LOG_TXNCODE_1009("1009", "账户退资"),
    LOG_TXNCODE_1010("1010", "账户销户"),

    LOG_TXNCODE_2001("2001", "终端消费上送"),
    LOG_TXNCODE_2002("2002", "终端心跳检测"),
    LOG_TXNCODE_2003("2003", "消费转发"),
    LOG_TXNCODE_2004("2004", "交易查询"),

    LOG_TXNCODE_3001("3001", "充值申请"),
    LOG_TXNCODE_3002("3002", "卡片充值"),
    LOG_TXNCODE_3003("3003", "充值管理指令申请"),
    LOG_TXNCODE_3004("3004", "充值结果通知"),
    LOG_TXNCODE_3005("3005", "TSM发卡商充值额度查询"),

    LOG_TXNCODE_4001("4001", "开锁密钥重置"),
    LOG_TXNCODE_4002("4002", "开锁密钥充值通知"),

    LOG_TXNCODE_5001("5001", "启用申请"),
    LOG_TXNCODE_5002("5002", "预制卡启用"),
    LOG_TXNCODE_5003("5003", "启用卡管理指令申请"),
    LOG_TXNCODE_5004("5004", "启用验证结果通知"),

    LOG_TXNCODE_6001("6001", "发卡申请"),
    LOG_TXNCODE_6002("6002", "卡片发卡"),
    LOG_TXNCODE_6003("6003", "发卡管理指令申请"),
    LOG_TXNCODE_6004("6004", "发卡验卡结果通知"),
    LOG_TXNCODE_6005("6005", "TSM发卡商库存查询"),
    
    REAL_NAME_0("0", "未实名"),
    REAL_NAME_1("1", "已实名"),
    
    /**
	 * 实名信息标识 ‘Y’-存在 ‘N’-不存在
	 */
	REAL_NAME_Y("Y","存在"),
	
	/**
	 * 实名信息标识 ‘Y’-存在 ‘N’-不存在
	 */
	REAL_NAME_N("N","不存在"),


	/**
	 * 卡组织： 001-住建部 002-Pboc 003-交通部 004-62BIN 005-虚拟电子卡 006-账户系统
	 */
    CARDORG_001("001","住建部"),
    /**
	 * 卡组织： 001-住建部 002-Pboc 003-交通部 004-62BIN 005-虚拟电子卡 006-账户系统
	 */
    CARDORG_002("002","Pboc"),
    /**
	 * 卡组织： 001-住建部 002-Pboc 003-交通部 004-62BIN 005-虚拟电子卡 006-账户系统
	 */
    CARDORG_003("003","交通部"),
    /**
	 * 卡组织： 001-住建部 002-Pboc 003-交通部 004-62BIN 005-虚拟电子卡 006-账户系统
	 */
    CARDORG_004("004","62BIN"),
    /**
	 * 卡组织： 001-住建部 002-Pboc 003-交通部 004-62BIN 005-虚拟电子卡 006-账户系统
	 */
    CARDORG_005("005","虚拟电子卡"),
    /**
	 * 卡组织： 001-住建部 002-Pboc 003-交通部 004-62BIN 005-虚拟电子卡 006-账户系统
	 */
    CARDORG_006("006","账户系统"),
    
	/*********** 自定义的实名认证 认证要素类型参数（和注册共用此字段）  **************/
	/**
	 * 0011：手机号 0023：姓名+证件号 0032：姓名+证件号+手机号 0041：银行卡号+姓名+证件号+手机号 
	 */
	AUTH_FACTOR_TYPE_0011("0011", "手机号"),
	/**
	 * 0021：银行卡号+姓名 0022：银行卡号+证件号 0023：姓名+证件号 0031：银行卡号+姓名+证件号 0032：姓名+证件号+手机号
	 * 0041：银行卡号+姓名+证件号+手机号
	 */
	AUTH_FACTOR_TYPE_0032("0032", "姓名+证件号+手机号"),
	
	/**
	 * 实名认证标志 1：已认证
	 */
	CERT_FLAG_1("1", "已认证"),
    ;
    private String code;
    private String name;

    private Constant(String code, String name) {
        this.code = code;
        this.name = name;
    }

    public String getCode() {
        return code;
    }

    public void setCode(String code) {
        this.code = code;
    }

    public String getName() {
        return name;
    }

    public void setName(String name) {
        this.name = name;
    }

}
